
class DBManager:
    '''
    Класс, который будет подключаться к БД PostgreSQL
    '''
    def get_companies_and_vacancies_count(self):
       """
        — получает список всех компаний и количество вакансий у каждой компании.
       :return:
       """

    def get_all_vacancies(self):
        """
         — получает список всех вакансий с указанием названия компании, названия вакансии и зарплаты и ссылки на вакансию.
        :return:
        """

    def get_avg_salary(self):
        """
         — получает среднюю зарплату по вакансиям.
        :return:
        """

    def get_vacancies_with_higher_salary(self):
        """
         — получает список всех вакансий, у которых зарплата выше средней по всем вакансиям.
        :return:
        """

    def get_vacancies_with_keyword():
        """
         — получает список всех вакансий, в названии которых содержатся переданные в метод слова, например python.
        :return:
        """
